---
kind: other
id: Properties.T:Autodesk.Revit.DB.STLImportOptions
source: html/22771185-2155-fc92-9933-e519d4e6a75b.htm
---
# STLImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.